Repository: moaaj/donation-system-clean
Catalog: donation/locale/*/LC_MESSAGES/django.po
Languages: ms

source: Home
ms: Utama

source: Donate
ms: Derma

source: Events
ms: Acara

source: School Fees
ms: Yuran Sekolah

source: AI Analytics
ms: Analisis AI

source: Waqaf Analytics
ms: Analisis Waqaf

source: Donation Cart
ms: Troli Derma

source: Total Amount
ms: Jumlah Keseluruhan

source: Your Donation
ms: Derma Anda

source: Your Message
ms: Mesej Anda

source: Update
ms: Kemaskini

source: Remove
ms: Buang

source: Clear Cart
ms: Kosongkan Troli

source: Add More Events
ms: Tambah Acara Lagi

source: Proceed to Checkout
ms: Teruskan ke Bayaran

source: Your cart is empty
ms: Troli anda kosong

source: Start making a difference by adding donation events to your cart!
ms: Mula membuat perbezaan dengan menambah acara derma ke troli anda!

source: Browse Events
ms: Layari Acara

source: Save
ms: Simpan

source: Cancel
ms: Batal

source: Delete
ms: Padam

source: Add
ms: Tambah

source: Search
ms: Cari

source: Submit
ms: Hantar

source: Back
ms: Kembali

source: Next
ms: Seterusnya

source: Previous
ms: Sebelumnya

source: Are you sure you want to remove this item from your cart?
ms: Adakah anda pasti mahu membuang item ini dari troli anda?

source: Are you sure you want to clear your entire cart?
ms: Adakah anda pasti mahu mengosongkan keseluruhan troli anda?

source: An error occurred while updating the cart item.
ms: Ralat berlaku semasa mengemas kini item troli.

source: Charity Platform
ms: Platform Amal

source: Making a difference one contribution at a time.
ms: Membuat perbezaan satu sumbangan pada satu masa.

source: All rights reserved.
ms: Hak cipta terpelihara.

source: Language
ms: Bahasa

source: English
ms: Bahasa Inggeris

source: Malay
ms: Bahasa Melayu

source: Donation Amount
ms: Jumlah Derma

source: Message
ms: Mesej

source: Optional
ms: Pilihan

source: Leave a message for this cause...
ms: Tinggalkan mesej untuk tujuan ini...

source: Total Donation Amount
ms: Jumlah Derma Keseluruhan

source: Make a Difference Today
ms: Buat Perbezaan Hari Ini

source: Join us in our mission to support education, provide donations, and manage waqaf properties for a better tomorrow.
ms: Sertai kami dalam misi untuk menyokong pendidikan, memberikan derma, dan menguruskan harta waqaf untuk masa depan yang lebih baik.

source: Explore Modules
ms: Terokai Modul

source: Our Modules
ms: Modul Kami

source: Support students' education by contributing to their school fees. Help shape the future of our youth.
ms: Sokong pendidikan pelajar dengan menyumbang kepada yuran sekolah mereka. Bantu membentuk masa depan generasi muda kita.

source: Learn More
ms: Ketahui Lebih Lanjut

source: Donations
ms: Derma

source: Make a direct impact through your generous donations. Every contribution makes a difference.
ms: Buat impak langsung melalui derma murah hati anda. Setiap sumbangan membuat perbezaan.

source: Donate Now
ms: Derma Sekarang

source: Contribute to sustainable development through waqaf properties. Create lasting benefits for the community.
ms: Sumbang kepada pembangunan mampan melalui harta waqaf. Cipta faedah berkekalan untuk komuniti.

source: Explore Waqaf
ms: Terokai Waqaf

source: Our Impact
ms: Impak Kami

source: Students Supported
ms: Pelajar Disokong

source: Through school fees assistance
ms: Melalui bantuan yuran sekolah

source: Donations Raised
ms: Derma Dikumpul

source: For various charitable causes
ms: Untuk pelbagai tujuan amal

source: Waqaf Properties
ms: Harta Waqaf

source: Managed for community benefit
ms: Dikelola untuk faedah komuniti
